# Taps
tap "cloudflare/cloudflare"
tap "dart-lang/dart"
tap "hashicorp/tap"
tap "leoafarias/fvm"
tap "ngrok/ngrok"
tap "stripe/stripe-cli"

# Formulae
brew "biome"
brew "chromaprint"
brew "cloudflared"
brew "cocoapods"
brew "dart-lang/dart/dart"
brew "doctl"
brew "fish"
brew "freetds"
brew "gcc"
brew "gh"
brew "hugo"
brew "icu4c@77"
brew "jpeg"
brew "lazygit"
brew "leoafarias/fvm/fvm"
brew "libavif"
brew "libpq"
brew "librsvg"
brew "make"
brew "minikube"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "postgresql@16"
brew "postgresql@17"
brew "python-setuptools"
brew "python@3.12"
brew "rebar3"
brew "starship"
brew "stripe/stripe-cli/stripe"
brew "telnet"
brew "wxwidgets"

# Casks
cask "ghostty"
cask "1password-cli"
cask "claude-code"
cask "docker-desktop"
cask "flutter"
cask "gcloud-cli"
cask "google-cloud-sdk"
cask "ngrok"
cask "warp"
